Tekla Open API Reference for Tekla Structures 2025
Material Properties
The Material type exposes the following members.
Properties
Name | Description
MaterialString
 Identifies the material in a string format.
Top
See Also
Reference
Material Class
Tekla.Structures.Model Namespace